# View Systems Analysis Report Systems Analysis Output Folder Property

Source: https://www.revitapidocs.com/2026/f7814f7b-fdd7-79cc-bda3-7b6bd4906ed1.htm

---

| View Systems Analysis Report Systems Analysis Output Folder Property |
| --- |

The full path of the output folder for systems analysis.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string SystemsAnalysisOutputFolder { get; }
```

```
Public ReadOnly Property SystemsAnalysisOutputFolder As String
	Get
```

```
public:
property String^ SystemsAnalysisOutputFolder {
	String^ get ();
}
```

```
member SystemsAnalysisOutputFolder : string with get
```

#### Property Value

String See Also

#### Reference

ViewSystemsAnalysisReport Class Autodesk.Revit.DB.Analysis Namespace